7767517
60 68
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 220 0=32 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=1 6=4704
Pooling          MaxPool_1                1 1 220 149 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 149 149_splitncnn_0 149_splitncnn_1
Convolution      Conv_2                   1 1 149_splitncnn_1 223 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             Relu_3                   1 1 223 152
Convolution      Conv_4                   1 1 152 226 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
BinaryOp         Add_5                    2 1 149_splitncnn_0 226 155 0=0
ReLU             Relu_6                   1 1 155 156
Split            splitncnn_1              1 2 156 156_splitncnn_0 156_splitncnn_1
Convolution      Conv_7                   1 1 156_splitncnn_1 229 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             Relu_8                   1 1 229 159
Convolution      Conv_9                   1 1 159 232 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
BinaryOp         Add_10                   2 1 156_splitncnn_0 232 162 0=0
ReLU             Relu_11                  1 1 162 163
Split            splitncnn_2              1 2 163 163_splitncnn_0 163_splitncnn_1
Convolution      Conv_12                  1 1 163_splitncnn_1 235 0=64 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=2048
Convolution      Conv_13                  1 1 163_splitncnn_0 238 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
ReLU             Relu_14                  1 1 238 168
Convolution      Conv_15                  1 1 168 241 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_16                   2 1 235 241 171 0=0
ReLU             Relu_17                  1 1 171 172
Split            splitncnn_3              1 2 172 172_splitncnn_0 172_splitncnn_1
Convolution      Conv_18                  1 1 172_splitncnn_1 244 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_19                  1 1 244 175
Convolution      Conv_20                  1 1 175 247 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_21                   2 1 172_splitncnn_0 247 178 0=0
ReLU             Relu_22                  1 1 178 179
Split            splitncnn_4              1 2 179 179_splitncnn_0 179_splitncnn_1
Convolution      Conv_23                  1 1 179_splitncnn_1 250 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=8192
Convolution      Conv_24                  1 1 179_splitncnn_0 253 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_25                  1 1 253 184
Convolution      Conv_26                  1 1 184 256 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         Add_27                   2 1 250 256 187 0=0
ReLU             Relu_28                  1 1 187 188
Split            splitncnn_5              1 2 188 188_splitncnn_0 188_splitncnn_1
Convolution      Conv_29                  1 1 188_splitncnn_1 259 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_30                  1 1 259 191
Convolution      Conv_31                  1 1 191 262 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         Add_32                   2 1 188_splitncnn_0 262 194 0=0
ReLU             Relu_33                  1 1 194 195
Split            splitncnn_6              1 2 195 195_splitncnn_0 195_splitncnn_1
Convolution      Conv_34                  1 1 195_splitncnn_1 265 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=32768
Convolution      Conv_35                  1 1 195_splitncnn_0 268 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_36                  1 1 268 200
Convolution      Conv_37                  1 1 200 271 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         Add_38                   2 1 265 271 203 0=0
ReLU             Relu_39                  1 1 203 204
Split            splitncnn_7              1 2 204 204_splitncnn_0 204_splitncnn_1
Convolution      Conv_40                  1 1 204_splitncnn_1 274 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_41                  1 1 274 207
Convolution      Conv_42                  1 1 207 277 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         Add_43                   2 1 204_splitncnn_0 277 210 0=0
ReLU             Relu_44                  1 1 210 211
Convolution      Conv_45                  1 1 211 212 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Reshape          Reshape_47               1 1 212 214 0=1800
InnerProduct     Gemm_48                  1 1 214 215 0=256 1=1 2=460800
ReLU             Relu_49                  1 1 215 216
InnerProduct     Gemm_50                  1 1 216 217 0=4680 1=1 2=1198080
Reshape          Reshape_52               1 1 217 output 0=4 1=18 2=65
